Revit 2024 API
DefinitionGroup Class
The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DefinitionGroup : APIObject
Visual Basic
Public Class DefinitionGroup _
	Inherits APIObject
Visual C++
public ref class DefinitionGroup : public APIObject
Remarks
Groups are used for logical arrangement of the shared parameters into meaningful sets. Through the DefinitionGroup object new shared parameter definitions can be made.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionGroup
See Also
DefinitionGroup Members
Autodesk.Revit.DB Namespace